In [10]:
#AdamSygut_302921
import pandas as pd
d = {'name':["Jan", "Tomasz", "Grzegorz", "Wiesław", "Robert"],'surname':["Nowak", "Kowalski", "Gąsienica", "Polak", "Niemiec"],'age':[11,22,33,44,55],'sex':["man","man","man","man","man"]}
df = pd.DataFrame(data=d)
print(df)

       name    surname  age  sex
0       Jan      Nowak   11  man
1    Tomasz   Kowalski   22  man
2  Grzegorz  Gąsienica   33  man
3   Wiesław      Polak   44  man
4    Robert    Niemiec   55  man

In [11]:
#pandas inf
df.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
name       5 non-null object
surname    5 non-null object
age        5 non-null int64
sex        5 non-null object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [19]:
#pandas describe
df.describe(include='all')

          name  surname        age  sex
count        5        5   5.000000    5
unique       5        5        NaN    1
top     Tomasz  Niemiec        NaN  man
freq         1        1        NaN    5
mean       NaN      NaN  33.000000  NaN
std        NaN      NaN  17.392527  NaN
min        NaN      NaN  11.000000  NaN
25%        NaN      NaN  22.000000  NaN
50%        NaN      NaN  33.000000  NaN
75%        NaN      NaN  44.000000  NaN
max        NaN      NaN  55.000000  NaN

In [12]:
#3 pierwsze pandas head
df.head(3)

       name    surname  age  sex
0       Jan      Nowak   11  man
1    Tomasz   Kowalski   22  man
2  Grzegorz  Gąsienica   33  man